IDEA StatiCa Open Model
ReinfBarOnEdge.ExtendTypeBegin Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 type of extension of beginning of bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public BarEndExtendType ExtendTypeBegin { get; set; }
Public Property ExtendTypeBegin As BarEndExtendType
	Get
	Set
public:
property BarEndExtendType ExtendTypeBegin {
	BarEndExtendType get ();
	void set (BarEndExtendType value);
}
Property Value
Type: BarEndExtendType
See Also
Reference
ReinfBarOnEdge Class
IdeaRS.OpenModel.Detail Namespace